// 3-33 상수를 사용하여 2차원 배열의 값 출력 (2)
// 올바른 결과를 보장하지 않습니다.
#include <stdio.h>
void main() {
  int iarr2[2][3] = {10, 20, 30, 40, 50, 60};

  printf("%x\n", iarr2);
  printf("%d %d %d %d %d %d \n", iarr2[0][0], iarr2[0][1], iarr2[0][2], iarr2[1][0], iarr2[1][1], iarr2[1][2]);
  printf("%d %d %d %d %d %d \n",
         ((int (*)[3])0xc45ff770)[0][0],
         ((int (*)[3])0xc45ff770)[0][1],
         ((int (*)[3])0xc45ff770)[0][2],
         ((int (*)[3])0xc45ff770)[1][0],
         ((int (*)[3])0xc45ff770)[1][1],
         ((int (*)[3])0xc45ff770)[1][2]);
  // (int (*)[3]): 길이 3인 int 배열을 가리키는 포인터
  // cf. int *[3]: 길이 3인 포인터 배열 (int* 가 3개 들어있는)
}